app/Http/Controllers/API/ProfileController.php

insert into `profile` (`name`, `age`, `job`, `startdate`, `enddate`, `companyname`, `companylogo`, `jobdescript`, `image`, `updated_at`, `created_at`) values ('Obedi Obadiah', '26', 'Developer', '27-03-2007', '27-03-2016', 'Novatech', 'Novatech.jpg', 'Software developer', 'Novatech.png', '2022-03-13 12:57:47', '2022-03-13 12:57:47')
---
    public function SaveIdentity(Request $request)
    {


        $request->validate([
            'name' => 'required',
            'age' => 'required',
        ]);

        $profile_identity = new profile_identity;
        $profile_identity->name = $request->input('name');
        $profile_identity->age = $request->input('age');
        $profile_identity->image = $request->input('image');

        $profile_identity->save();

insert into `profile_identity` (`name`, `age`, `image`, `updated_at`, `created_at`) values ('Obedi Obadiah Mw', '35', 'blob:http://localhost:3000/579f9a38-1813-4ccd-8fbb-1825fc827f8c', '2022-03-14 15:38:59', '2022-03-14 15:38:59')
---
    public function EditIdentity($id, Request $request)
    {


        $request->validate([
            'name' => 'required',
            'age' => 'required',
        ]);

        $profile_identity = new profile_identity;
        $profile_identity->name = $request->input('name');
        $profile_identity->age = $request->input('age');
        $profile_identity->image = $request->input('image');

        $profile_identity->save();