app/Http/Controllers/API/ProfileController.php

    public function SaveIdentity(Request $request)
    {


        $request->validate([
            'name' => 'required',
            'age' => 'required',
        ]);

        $profile_identity = new profile_identity;
        $profile_identity->name = $request->input('name');
        $profile_identity->age = $request->input('age');
        $profile_identity->image = $request->input('image');

        $profile_identity->save();
---
insert into `profile_identity` (`name`, `age`, `image`, `updated_at`, `created_at`) values ('Obedi Obadiah Mw', '44', 'blob:http://localhost:3000/3f3fe02e-da7a-497c-b0a7-a0899a3c7e56', '2022-03-14 12:26:30', '2022-03-14 12:26:30')